zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csx_v2.c
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
            if (context->ptrCommonConfig->csxMfsDividerOffsetF1 >
               context->ptrCommonConfig->csxMfsDividerOffsetF2)
            {
                snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF1;
            }
            else
            {
                snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF2;
            }

            isBusyWatchdogTimeUs  = (uint64_t)totalSns * CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM * ptrWdCfg->ptrWdContext->resolution;
        #else
            isBusyWatchdogTimeUs  = (uint64_t)totalSns * ptrWdCfg->ptrWdContext->resolution;
        #endif

        isBusyWatchdogTimeUs *= (uint64_t)snsClkDivider * modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

        if (0uL == isBusyWatchdogTimeUs)
        {
            isBusyWatchdogTimeUs = 1u;
        }

        isBusyWatchdogTimeUs *= CY_CAPSENSE_CSX_WATCHDOG_MARGIN_COEFF;

        /* Perform binary search for accurate IDAC value for each sensor/node */
        do
        {
            /* Scan all the sensors/nodes in widget */
            (void)Cy_CapSense_SetupWidget(widgetId, context);
            (void)Cy_CapSense_Scan(context);

            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
            watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

            /* Wait for EOS */
            while (CY_CAPSENSE_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
            {
                if (0uL == watchdogCounter)
                {
                    break;
                }

                watchdogCounter--;
            }

            /* Set pointer to the widget's first sensor data */
            ptrActSnsContext = ptrWdCfg->ptrSnsContext;

            /* Check raw count and adjust IDAC, loop through all the sensors/nodes */
            for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
            {
                for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
                {
                    /* Check whether the current raw count is above target.
                    * If yes, clear the MS bit of bit.
                    * If no, keep the MS bit and set next bit.
                    */
                    if (ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].raw > rawTarget)
                    {
                        ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].idacComp &= (uint8_t)(~curIdacMask);
                    }
                    ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].idacComp |= nextIdacMask;
                }
            }

            /* Shift both current IDAC and pre IDAC values to the right by 1 */
            curIdacMask = nextIdacMask;
            nextIdacMask = nextIdacMask >> 1u;
        }
        while (curIdacMask != 0u);
        calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
    {
        /* Perform specified widget scan to check calibration result */
        /* Scan all the sensors/nodes in widget */
        (void)Cy_CapSense_SetupWidget(widgetId, context);
        (void)Cy_CapSense_Scan(context);

        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        /* Wait for EOS */
        while (CY_CAPSENSE_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
        {
            if (0uL == watchdogCounter)
            {
                calibrateStatus = CY_CAPSENSE_STATUS_TIMEOUT;
                break;
            }

            watchdogCounter--;
        }

        if (CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
        {
            calibrateStatus = Cy_CapSense_CalibrateCheck(widgetId, target, CY_CAPSENSE_CSX_GROUP, context);
        }
    }

    return calibrateStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CSXSetUpIdacs
****************************************************************************//**
*
* Configures IDAC for the CSX sensing method.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXSetUpIdacs(cy_stc_capsense_context_t * context)
{
    uint32_t tmpRegVal;

    /* Set IDAC gain */
    tmpRegVal = context->ptrCommonConfig->idacGainTable[context->ptrActiveScanSns->ptrWdContext->idacGainIndex].gainReg;
    /* Set IDAC code */
    tmpRegVal |= (uint32_t)context->ptrActiveScanSns->ptrSnsContext->idacComp & CY_CAPSENSE_CSD_IDACA_VAL_MSK;
    tmpRegVal |= CY_CAPSENSE_DEFAULT_CSD_IDACA_CFG;

    context->ptrCommonConfig->ptrCsdBase->IDACA = tmpRegVal;
}

/*******************************************************************************
* Function Name: Cy_CapSense_SsCSXStartSample
****************************************************************************//**
*
* Starts scanning for the CSX widget.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXStartSample(cy_stc_capsense_context_t * context)
{
    /* Set up IDAC Value */
    Cy_CapSense_CSXSetUpIdacs(context);

    /* Clear previous interrupts */
    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR;

    /* Enable interrupt */
    context->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR_MASK;
    if (NULL != context->ptrInternalContext->ptrSSCallback)
    {
        context->ptrInternalContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    Cy_CapSense_CSXStartSampleExt(context);
}


